Output of `terraform plan` against `prod-sbx`with bogus input vars:

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.stateless.module.etl_instance.aws_instance.main must be replaced
-/+ resource "aws_instance" "main" {
      ~ ami                          = "ami-0de5fcac1b1059096" -> "ami-031726eadf10e95f8" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:577373831711:instance/i-089222762059f685e" -> (known after apply)
        associate_public_ip_address  = false
        availability_zone            = "us-east-1b"
      ~ cpu_core_count               = 4 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
        ebs_optimized                = true
        get_password_data            = false
      + host_id                      = (known after apply)
        iam_instance_profile         = "bfd-prod-sbx-etl-profile"
      ~ id                           = "i-089222762059f685e" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
        instance_type                = "m5.2xlarge"
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
        key_name                     = "bfd-prod-sbx"
        monitoring                   = true
      + network_interface_id         = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0957b823fefa9ebde" -> (known after apply)
      ~ private_dns                  = "ip-10-252-19-234.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.252.19.234" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ security_groups              = [] -> (known after apply)
        source_dest_check            = true
        subnet_id                    = "subnet-0b8807d98a1d4ecb1"
        tags                         = {
            "Environment" = "prod-sbx"
            "Layer"       = "data"
            "Name"        = "bfd-prod-sbx-etl"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "etl"
            "stack"       = "prod-sbx"
        }
        tenancy                      = "dedicated"
      ~ user_data                    = "991e3eae284e69ea59f394e8f1ac3d1c07c538df" -> "2b15c5e69579084743b2c0563d95d914cd6feaa2" # forces replacement
        volume_tags                  = {
            "Environment" = "prod-sbx"
            "Layer"       = "data"
            "Name"        = "bfd-prod-sbx-etl"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "etl"
            "snapshot"    = "true"
            "stack"       = "prod-sbx"
        }
      ~ vpc_security_group_ids       = [
          + "sg-086653eab42c1b423",
            "sg-09f5c76e419f1a514",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
            delete_on_termination = true
            encrypted             = true
          ~ iops                  = 300 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:577373831711:key/ad6db5fa-8947-4aab-acff-627deec86253" -> "alias/bfd-prod-sbx-cmk" # forces replacement
          ~ volume_id             = "vol-0166918474d24ccd1" -> (known after apply)
            volume_size           = 100
            volume_type           = "gp2"
        }
    }

  # module.stateless.module.fhir_asg.aws_autoscaling_group.main must be replaced
+/- resource "aws_autoscaling_group" "main" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:577373831711:autoScalingGroup:59656716-3749-473a-a153-b352909fe94e:autoScalingGroupName/bfd-prod-sbx-fhir-4" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-1a",
          - "us-east-1b",
          - "us-east-1c",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
        desired_capacity          = 3
        enabled_metrics           = [
            "GroupDesiredCapacity",
            "GroupInServiceInstances",
            "GroupMaxSize",
            "GroupMinSize",
            "GroupPendingInstances",
            "GroupStandbyInstances",
            "GroupTerminatingInstances",
            "GroupTotalInstances",
        ]
        force_delete              = false
        health_check_grace_period = 300
        health_check_type         = "ELB"
      ~ id                        = "bfd-prod-sbx-fhir-4" -> (known after apply)
        load_balancers            = [
            "bfd-prod-sbx-fhir",
        ]
        max_size                  = 6
        metrics_granularity       = "1Minute"
        min_elb_capacity          = 3
        min_size                  = 3
      ~ name                      = "bfd-prod-sbx-fhir-4" -> (known after apply) # forces replacement
        protect_from_scale_in     = false
      ~ service_linked_role_arn   = "arn:aws:iam::577373831711:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
      ~ target_group_arns         = [] -> (known after apply)
      - termination_policies      = [] -> null
        vpc_zone_identifier       = [
            "subnet-0955d67aa6ab4e9ae",
            "subnet-0993e68dd413cbe14",
            "subnet-0e641fb39fd38e0ca",
        ]
        wait_for_capacity_timeout = "10m"
        wait_for_elb_capacity     = 3

      ~ launch_template {
          ~ id      = "lt-0dd1ba0be6ecc3da8" -> (known after apply)
            name    = "bfd-prod-sbx-fhir"
          ~ version = "4" -> (known after apply)
        }

        tag {
            key                 = "Environment"
            propagate_at_launch = true
            value               = "prod-sbx"
        }
        tag {
            key                 = "Layer"
            propagate_at_launch = true
            value               = "app"
        }
        tag {
            key                 = "Name"
            propagate_at_launch = true
            value               = "bfd-prod-sbx-fhir"
        }
        tag {
            key                 = "application"
            propagate_at_launch = true
            value               = "bfd"
        }
        tag {
            key                 = "business"
            propagate_at_launch = true
            value               = "oeda"
        }
        tag {
            key                 = "role"
            propagate_at_launch = true
            value               = "fhir"
        }
        tag {
            key                 = "stack"
            propagate_at_launch = true
            value               = "prod-sbx"
        }
    }

  # module.stateless.module.fhir_asg.aws_autoscaling_policy.high-cpu must be replaced
-/+ resource "aws_autoscaling_policy" "high-cpu" {
        adjustment_type           = "ChangeInCapacity"
      ~ arn                       = "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:a77c27a3-25ec-4b93-8843-6779f10881d7:autoScalingGroupName/bfd-prod-sbx-fhir-4:policyName/bfd-prod-sbx-fhir-high-cpu-scaleup" -> (known after apply)
      ~ autoscaling_group_name    = "bfd-prod-sbx-fhir-4" -> (known after apply) # forces replacement
        cooldown                  = 300
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "bfd-prod-sbx-fhir-high-cpu-scaleup" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
        name                      = "bfd-prod-sbx-fhir-high-cpu-scaleup"
        policy_type               = "SimpleScaling"
        scaling_adjustment        = 2
    }

  # module.stateless.module.fhir_asg.aws_autoscaling_policy.low-cpu must be replaced
-/+ resource "aws_autoscaling_policy" "low-cpu" {
        adjustment_type           = "ChangeInCapacity"
      ~ arn                       = "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:ed637d29-98c7-421f-9c54-bc1a1b7ea7ff:autoScalingGroupName/bfd-prod-sbx-fhir-4:policyName/bfd-prod-sbx-fhir-low-cpu-scaledown" -> (known after apply)
      ~ autoscaling_group_name    = "bfd-prod-sbx-fhir-4" -> (known after apply) # forces replacement
        cooldown                  = 300
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "bfd-prod-sbx-fhir-low-cpu-scaledown" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
        name                      = "bfd-prod-sbx-fhir-low-cpu-scaledown"
        policy_type               = "SimpleScaling"
        scaling_adjustment        = -1
    }

  # module.stateless.module.fhir_asg.aws_cloudwatch_metric_alarm.high-cpu will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "high-cpu" {
        actions_enabled           = true
      ~ alarm_actions             = [
          - "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:a77c27a3-25ec-4b93-8843-6779f10881d7:autoScalingGroupName/bfd-prod-sbx-fhir-4:policyName/bfd-prod-sbx-fhir-high-cpu-scaleup",
        ] -> (known after apply)
      ~ alarm_description         = "CPU usage for bfd-prod-sbx-fhir-4 ASG" -> (known after apply)
        alarm_name                = "bfd-prod-sbx-fhir-high-cpu"
        arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-prod-sbx-fhir-high-cpu"
        comparison_operator       = "GreaterThanOrEqualToThreshold"
        datapoints_to_alarm       = 0
      ~ dimensions                = {
          - "AutoScalingGroupName" = "bfd-prod-sbx-fhir-4"
        } -> (known after apply)
        evaluation_periods        = 2
        id                        = "bfd-prod-sbx-fhir-high-cpu"
        insufficient_data_actions = []
        metric_name               = "CPUUtilization"
        namespace                 = "AWS/EC2"
        ok_actions                = []
        period                    = 120
        statistic                 = "Average"
        tags                      = {}
        threshold                 = 60
        treat_missing_data        = "missing"
    }

  # module.stateless.module.fhir_asg.aws_cloudwatch_metric_alarm.low-cpu will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "low-cpu" {
        actions_enabled           = true
      ~ alarm_actions             = [
          - "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:ed637d29-98c7-421f-9c54-bc1a1b7ea7ff:autoScalingGroupName/bfd-prod-sbx-fhir-4:policyName/bfd-prod-sbx-fhir-low-cpu-scaledown",
        ] -> (known after apply)
      ~ alarm_description         = "CPU usage for bfd-prod-sbx-fhir-4 ASG" -> (known after apply)
        alarm_name                = "bfd-prod-sbx-fhir-low-cpu"
        arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-prod-sbx-fhir-low-cpu"
        comparison_operator       = "LessThanOrEqualToThreshold"
        datapoints_to_alarm       = 0
      ~ dimensions                = {
          - "AutoScalingGroupName" = "bfd-prod-sbx-fhir-4"
        } -> (known after apply)
        evaluation_periods        = 2
        id                        = "bfd-prod-sbx-fhir-low-cpu"
        insufficient_data_actions = []
        metric_name               = "CPUUtilization"
        namespace                 = "AWS/EC2"
        ok_actions                = []
        period                    = 120
        statistic                 = "Average"
        tags                      = {}
        threshold                 = 20
        treat_missing_data        = "missing"
    }

  # module.stateless.module.fhir_asg.aws_launch_template.main will be updated in-place                                                                                                                                                                                                                                                                                                                                                                                                                                                                   [72/36715]
  ~ resource "aws_launch_template" "main" {
        arn                     = "arn:aws:ec2:us-east-1:577373831711:launch-template/lt-0dd1ba0be6ecc3da8"
        default_version         = 1
        description             = "Template for the prod-sbx environment fhir servers"
        disable_api_termination = false
        ebs_optimized           = "true"
        id                      = "lt-0dd1ba0be6ecc3da8"
      ~ image_id                = "ami-0815d71cf5584acb6" -> "ami-0987a430b7780d435"
        instance_type           = "m5.2xlarge"
        key_name                = "bfd-prod-sbx"
      ~ latest_version          = 4 -> (known after apply)
        name                    = "bfd-prod-sbx-fhir"
        security_group_names    = []
        tags                    = {}
        user_data               = "IyEvYmluL2Jhc2gKc2V0IC1lCgpleGVjID4gPih0ZWUgLWEgL3Zhci9sb2cvdXNlcl9kYXRhLmxvZyAyPiYxKQoKZ2l0IGNsb25lIGh0dHBzOi8vZ2l0aHViLmNvbS9DTVNnb3YvYmVuZWZpY2lhcnktZmhpci1kYXRhLmdpdCAtLWJyYW5jaCBtYXN0ZXIgLS1zaW5nbGUtYnJhbmNoCgpjZCBiZW5lZmljaWFyeS1maGlyLWRhdGEvb3BzL2Fuc2libGUvcGxheWJvb2tzLWNjcy8KCmdpdCBjaGVja291dCBtYXN0ZXIKCmF3cyBzMyBjcCBzMzovL2JmZC1tZ210LWFkbWluLTU3NzM3MzgzMTcxMS9hbnNpYmxlL3ZhdWx0LnBhc3N3b3JkIC4KCiMgVGhlIGV4dHJhX3ZhcnMuanNvbiBmaWxlIGZyb20gdGhlIHByZXZpb3VzIGJ1aWxkIHN0ZXAgY29udGFpbnMgYSBmZXcgaW5jb3JyZWN$
IHZhbHVlcwojIGFuZCBuZWVkcyB0byBnZXQgdHJpbW1lZCBkb3duIHRvIHRoZSBmb2xsb3dpbmcKY2F0IDw8RU9GID4+IGV4dHJhX3ZhcnMuanNvbgp7CiAgICAiZW52IjoicHJvZC1zYngiLAogICAgImRhdGFfc2VydmVyX2NvbnRhaW5lcl9uYW1lIjoid2lsZGZseS04LjEuMC5GaW5hbCIsCiAgICAiZGF0YV9zZXJ2ZXJfdmVyc2lvbiI6IjEuMC4wLVNOQVBTSE9UIgp9CkVPRgoKYW5zaWJsZS1wbGF5Ym9vayAtLWV4dHJhLXZhcnMgJ0BleHRyYV92YXJzLmpzb24nIC0tdmF1bHQtcGFzc3dvcmQtZmlsZT12YXVsdC5wYXNzd29yZCAtLXRhZ3MgInBvc3QtYW1pIiBsYXVuY2hfYmZkLXNlcnZlci55bWwKCnJtIHZhdWx0LnBhc3N3b3Jk"
        vpc_security_group_ids  = [
            "sg-0cd87e5da9eb47775",
            "sg-0d0c19b08a313e148",
        ]

        block_device_mappings {
            device_name = "/dev/sda1"

            ebs {
                delete_on_termination = "true"
                iops                  = 0
                volume_size           = 100
                volume_type           = "gp2"
            }
        }

        iam_instance_profile {
            name = "bfd-prod-sbx-fhir-profile"
        }

        monitoring {
            enabled = true
        }

        placement {
            tenancy = "dedicated"
        }

        tag_specifications {
            resource_type = "instance"
            tags          = {
                "Environment" = "prod-sbx"
                "Layer"       = "app"
                "Name"        = "bfd-prod-sbx-fhir"
                "application" = "bfd"
                "business"    = "oeda"
                "role"        = "fhir"
                "stack"       = "prod-sbx"
            }
        }
        tag_specifications {
            resource_type = "volume"
            tags          = {
                "Environment" = "prod-sbx"
                "Layer"       = "app"
                "Name"        = "bfd-prod-sbx-fhir"
                "application" = "bfd"
                "business"    = "oeda"
                "role"        = "fhir"
                "snapshot"    = "true"
                "stack"       = "prod-sbx"
            }
        }
    }

  # module.stateless.module.fhir_asg.aws_security_group.app[0] will be updated in-place
  ~ resource "aws_security_group" "app" {
        arn                    = "arn:aws:ec2:us-east-1:577373831711:security-group/sg-0d0c19b08a313e148"
        description            = "Allow access to app servers"
        egress                 = []
        id                     = "sg-0d0c19b08a313e148"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/8",
                ]
              - description      = ""
              - from_port        = 7443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 7443
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 7443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-05bb466a376bca3b3",
                ]
              + self             = false
              + to_port          = 7443
            },
        ]
        name                   = "bfd-prod-sbx-fhir-app"
        owner_id               = "577373831711"
        revoke_rules_on_delete = false
        tags                   = {
            "Environment" = "prod-sbx"
            "Layer"       = "app"
            "Name"        = "bfd-prod-sbx-fhir-app"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "fhir"
            "stack"       = "prod-sbx"
        }
        vpc_id                 = "vpc-0c891bb57e955f825"
    }

  # module.stateless.module.fhir_lb.aws_elb.main will be updated in-place
  ~ resource "aws_elb" "main" {
        arn                         = "arn:aws:elasticloadbalancing:us-east-1:577373831711:loadbalancer/bfd-prod-sbx-fhir"
        availability_zones          = [
            "us-east-1a",
            "us-east-1b",
            "us-east-1c",
        ]
        connection_draining         = false
        connection_draining_timeout = 300
        cross_zone_load_balancing   = false
        dns_name                    = "internal-bfd-prod-sbx-fhir-1922876557.us-east-1.elb.amazonaws.com"
        id                          = "bfd-prod-sbx-fhir"
        idle_timeout                = 60
        instances                   = [
            "i-0784ddaf48109ba50",
            "i-0b8b2ebda678ea34d",
            "i-0db543e0a4249ed70",
        ]
        internal                    = true
        name                        = "bfd-prod-sbx-fhir"
        security_groups             = [
            "sg-05bb466a376bca3b3",
        ]
        source_security_group       = "577373831711/bfd-prod-sbx-fhir-lb"
        source_security_group_id    = "sg-05bb466a376bca3b3"
        subnets                     = [
            "subnet-02cc4a4e8d5ffdb11",
            "subnet-0c78ef1670dccb1da",
            "subnet-0fc4374e606087aac",
        ]
        tags                        = {
            "Environment" = "prod-sbx"
            "Layer"       = "dmz"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "fhir"
            "stack"       = "prod-sbx"
        }
        zone_id                     = "Z35SXDOTRQ7X7K"

      ~ access_logs {
          ~ bucket        = "aws-hhs-cms-oeda-bfd" -> "bfd-prod-sbx-elb-577373831711"
          ~ bucket_prefix = "prod_sbx_fhir_elb_access_logs" -> "fhir_elb_access_logs"
          ~ enabled       = true -> false
            interval      = 5
        }

        health_check {
            healthy_threshold   = 5
            interval            = 10
            target              = "TCP:7443"
            timeout             = 5
            unhealthy_threshold = 2
        }

        listener {
            instance_port     = 7443
            instance_protocol = "tcp"
            lb_port           = 443
            lb_protocol       = "tcp"
        }
    }

Plan: 4 to add, 5 to change, 4 to destroy.
```